src/bsl/Enums/гкс_ТипыВзвешивания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_ТипыВзвешивания</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Въезд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выезд</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/Enums/гкс_ТипРегистрации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_ТипРегистрации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приемка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгрузка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/Enums/гкс_ТипыВзвешивания/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Определяет вид веса по типам взвешивания и регистрации
//
// Параметры:
//  ТипВзвешивания - ПеречислениеСсылка.гкс_ТипыВзвешивания - Въезд или Выезд
//                
//  ТипРегистрации - ПеречислениеСсылка.гкс_ТипРегистрации - Приемка или Отгрузка
//
// Возвращаемое значение:
//   Строка  - "Брутто", "Тара"
//
Функция ВидВеса(ТипВзвешивания, ТипРегистрации) Экспорт
	
	ВидыВесовПоВидамОперации = СоотвествиеВидовВеса();
	ЗначениеСоотвествия = ВидыВесовПоВидамОперации.Получить(СтрШаблон("%1%2", ТипВзвешивания, ТипРегистрации));
	
    Возврат ЗначениеСоотвествия;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоотвествиеВидовВеса()
	
	ТипыРегистрации = Перечисления.гкс_ТипРегистрации;
	ТипыВзвешивания = Перечисления.гкс_ТипыВзвешивания;
	
	Результат = Новый Соответствие;
	Результат.Вставить(СтрШаблон("%1%2", ТипыВзвешивания.Въезд, ТипыРегистрации.Приемка), "Брутто");
	Результат.Вставить(СтрШаблон("%1%2", ТипыВзвешивания.Въезд, ТипыРегистрации.Отгрузка), "Тара");
	Результат.Вставить(СтрШаблон("%1%2", ТипыВзвешивания.Выезд, ТипыРегистрации.Приемка), "Тара");
	Результат.Вставить(СтрШаблон("%1%2", ТипыВзвешивания.Выезд, ТипыРегистрации.Отгрузка), "Брутто");
	
	Возврат Результат;

КонецФункции	

#КонецОбласти
